===
Very simple if statement
===

if true {
    set msg True
    puts $msg
}

---

(source_file
 (if_command
  (if_clause
   condition: (boolean_word)
   body: (block
          (set_command
           name: (word)
           value: (boolean_word))
          (command
           name: (word)
           arguments: (word_list (variable_substitution)))))))

===
One-line if statement
===

if true then {set msg true; puts $msg} {set msg false; puts $msg}

---

(source_file
 (if_command
  (if_clause
   condition: (boolean_word)
   body: (block
          (set_command
           name: (word)
           value: (boolean_word))
          (command
           name: (word)
           arguments: (word_list (variable_substitution)))))
  (else_clause
   body: (block
          (set_command
           name: (word)
           value: (boolean_word))
          (command
           name: (word)
           arguments: (word_list (variable_substitution)))))))

===
Simple if statement
===

if {true} {
    puts True
} else {
    puts False
}

---

(source_file
 (if_command
  (if_clause
   condition: (braced_word (boolean_word))
   body: (block
          (command
           name: (word)
           arguments: (word_list (boolean_word)))))
  (else_clause
   body: (block
          (command
           name: (word)
           arguments: (word_list (boolean_word)))))))

===
If statement with elseif
===

set x 1

if {$x == 1} {
    puts One
} elseif {$x == 2} {
    puts Two
} elseif {$x == 3} {
    puts Three
} else {
    puts Other
}

---

(source_file
 (set_command
  name: (word)
  value: (word))

 (if_command
  (if_clause
   condition: (braced_word
               (variable_substitution)
               (word)
               (word))
   body: (block
          (command
           name: (word)
           arguments: (word_list (word)))))
  (elseif_clause
   condition: (braced_word
               (variable_substitution)
               (word)
               (word))
   body: (block
          (command
           name: (word)
           arguments: (word_list (word)))))
  (elseif_clause
   condition: (braced_word
               (variable_substitution)
               (word)
               (word))
   body: (block
          (command
           name: (word)
           arguments: (word_list (word)))))
  (else_clause
   body: (block
          (command
           name: (word)
           arguments: (word_list (word)))))))
